{"id":4857,"status":"NYC","timestamp":"2020-10-29T03:47:20.636784Z","comments":"This is good work! There are just a few small things:\n\n1. You use `let` a lot where you should be using `const`. Please make sure you know the difference and when to use them. \nBy using these things correctly it makes it easier to prevent bugs in complicated code. It also makes the intention of your code more clear. Good code always makes its intention clear. \n\n2. Your indentation is pretty funky. You're using vscode, right? There's a plugin called Prettier. I use it every day. You can set it up so that every time you save your code, all the formatting gets made super consistent. It saves loads of time. Try it out\n\n3. I tried this: \n\n```\n> lettersToMorseCode(\"The quick brown fox jumps over the lazy dog\")\nAssertion failed: [object Object]\n'.... . -.-- / - .... . .-. . - .... . / --.- ..- .. -.-. -.- / -... .-. --- .-- -. / ..-. --- -..- / .--- ..- -- .--. ... / --- ...- . .-. / - .... . / .-.. .- --.. -.-- / -.. --- --. - .... . / --.- ..- .. -.-. -.- / -... .-. --- .-- -. / ..-. --- -..- / .--- ..- -- .--. ... / --- ...- . .-. / - .... . / .-.. .- --.. -.-- / -.. --- --. - .... . / --.- ..- .. -.-. -.- / -... .-. --- .-- -. / ..-. --- -..- / .--- ..- -- .--. ... / --- ...- . .-. / - .... . / .-.. .- --.. -.-- / -.. --- --. '\n> \n\n```\nYour error message isn't clear. \n\n\n4. I tried this\n```\nmorse = lettersToMorseCode(\"the quick brown fox jumps over the lazy dog\")\n\nmorseCodeToLetters(morse)\nAssertion failed: [object Object]\n'hey therethe quick brown fox jumps over the lazy dogthe quick brown fox jumps over the lazy dogthe quick brown fox jumps over the lazy dogthe quick brown fox jumps over the lazy dog and away he goesthe quick brown fox jumps over the lazy dogthe quick brown fox jumps over the lazy dogthe quick brown fox jumps over the lazy dog'\n\n```\n\nAgain, the error message tells me nothing. But the new thing here is that for some reason your function is returning a bunch of stuff I experimented before. This should work:\n\n\n```\nconst s = \"the quick brown fox jumps over the lazy dog\"\nmorseCodeToLetters(lettersToMorseCode(s))) // this should be equal to s\nmorseCodeToLetters(lettersToMorseCode(s))) // this should still be equal to s\n```\n\nBriefly looking at your code, it looks like your problem is the global variables. Global variables are generally dangerous.You should only use that stuff when it's 100% necessary","recruitProject":2871,"reviewerUser":2,"reviewerUserEmail":"sheena.oconnell@umuzi.org"}